//;******************************************************************************
//;* Copyright (c) 2012 - 2015, Insyde Software Corp. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************
//; 
//; Module Name:
//; 
//;   Layoyt.uni
//; 
//; Abstract:
//; 
//;   Strings for SCU of setup browser
//; 

/=#

#langdef en-US "English"

#string ON_STRING                  #language en-US  "On"
#string OFF_STRING                 #language en-US  "Off"


#string DIALOG_POP_UP              #language en-US          "<VerticalLayout name='background' bkcolor='0xFF004D60' inset='160,28,160,28' >"
                                                              "<VerticalLayout >"
                                                                "<Label name='showstring' fontsize='24' textcolor='0xFFFFFF' />"
                                                              "</VerticalLayout>"
                                                              "<HorizontalLayout  name='content' height='30' />"
                                                            "</VerticalLayout>"
                                                            
#string DIALOG_ICON                #language en-US          "<VerticalLayout name='background' bkcolor='0xFF004D60' inset='160,0,160,0' >"
                                                              "<Control />"                                                               
                                                              "<VerticalLayout height='100' >"                                                              
                                                                "<Label name='showstring' fontsize='24' textcolor='0xFFFFFF' />"
                                                                "<UiEdit name='input' width='160' fontsize='24' textcolor='0xFF000000' password='true' textpadding='5,0,5,0' />"
                                                              "</VerticalLayout>"                                                              
                                                              "<Control />"
                                                            "</VerticalLayout>"

#string SHOW_PAGE_INFO             #language en-US          "<VerticalLayout name='background' bkcolor='0xFF004D60' inset='16,28,16,28' >"
                                                              "<Label name='title' height='60' align='center' fontsize='40' textcolor='0xFFFFFF' />"
                                                              "<VerticalLayout vscrollbar='true' >"
                                                                "<Label name='showstring' fontsize='20' textcolor='0xFFFFFF' />"
                                                              "</VerticalLayout>"
                                                              "<HorizontalLayout  name='content' height='30' />"
                                                            "</VerticalLayout>"
                                                            
#string SELECTION_DIALOG           #language en-US          "<VerticalLayout name='list' childpadding='10' bkcolor='0xFFFFFFFF' inset='2,2,0,0' vscrollbar='true' />"
                                                               

#string ENTER_OLD_PASSWORD_DIALOG  #language en-US          "<VerticalLayout name='background' bkcolor='0xFF004D60' inset='160,28,160,28' >"
                                                              "<VerticalLayout height='40' >"
                                                                "<Label name='title' fontsize='24' textcolor='0xFFFFFF' />"
                                                              "</VerticalLayout>"

                                                              "<HorizontalLayout height='30'>"
                                                                "<Label name='oldpasswordtext' fontsize='24' textcolor='0xFFFFFF' textpadding='2,0,2,0' width='400' />"
                                                                "<UiEdit name='oldpassword' width='160' fontsize='24' textcolor='0xFF000000' password='true' textpadding='5,0,5,0' />"
                                                              "</HorizontalLayout>"

                                                              "<HorizontalLayout height='30'>"
                                                                "<Label name='newpasswordtext' fontsize='24' textcolor='0xFFFFFF' textpadding='2,0,2,0' width='400' />"
                                                                "<UiEdit name='newpassword' width='160' fontsize='24' textcolor='0xFF000000' password='true' textpadding='5,0,5,0' />"
                                                              "</HorizontalLayout>"

                                                              "<HorizontalLayout height='30'>"
                                                                "<Label name='confirmpasswordtext' fontsize='24' textcolor='0xFFFFFF' textpadding='2,0,2,0' width='400' />"
                                                                "<UiEdit name='confirmpassword' width='160' fontsize='24' textcolor='0xFF000000' password='true' textpadding='5,0,5,0' />"
                                                              "</HorizontalLayout>"

                                                              "<HorizontalLayout height='30'>"
                                                                "<Control />"
                                                                "<Button name='ok' text='ok'    fontsize='24' />"
                                                                "<Button name='cancel' text='cancel' fontsize='24' />"
                                                              "</HorizontalLayout>"

                                                            "</VerticalLayout>"
                                                            
                                                            

#string ENTER_NEW_PASSWORD_DIALOG  #language en-US          "<VerticalLayout name='background' bkcolor='0xFF004D60' inset='160,28,160,28' >"
                                                              "<VerticalLayout height='40' >"
                                                                "<Label name='title' fontsize='24' textcolor='0xFFFFFF' />"
                                                              "</VerticalLayout>"

                                                              "<HorizontalLayout height='30'>"
                                                                "<Label name='newpasswordtext' fontsize='24' textcolor='0xFFFFFF' textpadding='2,0,2,0' width='400' />"
                                                                "<UiEdit name='newpassword' width='160' fontsize='24' textcolor='0xFF000000' password='true' textpadding='5,0,5,0' />"
                                                              "</HorizontalLayout>"

                                                              "<HorizontalLayout height='30'>"
                                                                "<Label name='confirmpasswordtext' fontsize='24' textcolor='0xFFFFFF' textpadding='2,0,2,0' width='400' />"
                                                                "<UiEdit name='confirmpassword' width='160' fontsize='24' textcolor='0xFF000000' password='true' textpadding='5,0,5,0' />"
                                                              "</HorizontalLayout>"

                                                              "<HorizontalLayout height='30'>"
                                                                "<Control />"
                                                                "<Button name='ok' text='ok'    fontsize='24' />"
                                                                "<Button name='cancel' text='cancel' fontsize='24' />"
                                                              "</HorizontalLayout>"
                                                            "</VerticalLayout>"
                                                            
                                                            
#string DATE_PICK_DIALOG         #language en-US            "<VerticalLayout name='background' bkcolor='0xFF004D60' inset='160,10,160,10' >"
                                                              "<VerticalLayout height='40' >"
                                                                "<Label name='title' fontsize='24' textcolor='0xFFFFFF' />"
                                                              "</VerticalLayout>"

                                                              "<HorizontalLayout childpadding='20'>"
                                                                //
                                                                // month
                                                                //
                                                                "<VerticalLayout width='160' childpadding='4'>"
                                                                  "<Button name='month_up' width='160' height='38' normalimage='@TimeDate1UpNormal' hotimage='@TimeDate1UpNormal' pushimage='@TimeDate1UpPush' />"
                                                                  "<UiEdit name='month' text='1' fontsize='38' align='center' readonly='true' />"
                                                                  "<Button name='month_down' width='160' height='38' normalimage='@TimeDate1DownNormal' hotimage='@TimeDate1DownNormal' pushimage='@TimeDate1DownPush' />"
                                                                "</VerticalLayout>"


                                                                //
                                                                // day
                                                                //
                                                                "<VerticalLayout width='160' childpadding='4'>"
                                                                  "<Button name='day_up' width='160'  height='38' normalimage='@TimeDate1UpNormal' hotimage='@TimeDate1UpNormal' pushimage='@TimeDate1UpPush' />"
                                                                  "<UiEdit name='day' fontsize='38' align='center' readonly='true'/>"
                                                                  "<Button name='day_down' width='160'  height='38' normalimage='@TimeDate1DownNormal' hotimage='@TimeDate1DownNormal' pushimage='@TimeDate1DownPush' />"
                                                                "</VerticalLayout>"

                                                                //
                                                                // year
                                                                //
                                                                "<VerticalLayout width='234' childpadding='4'>"
                                                                  "<Button name='year_up' width='234' height='38' normalimage='@TimeDate2UpNormal' hotimage='@TimeDate2UpNormal' pushimage='@TimeDate2UpPush' />"
                                                                  "<UiEdit name='year' fontsize='38' align='center' readonly='true'/>"
                                                                  "<Button name='year_down' width='234'  height='38' normalimage='@TimeDate2DownNormal' hotimage='@TimeDate2DownNormal' pushimage='@TimeDate2DownPush' />"
                                                                "</VerticalLayout>"
                                                              "</HorizontalLayout>"

                                                              "<HorizontalLayout height='30'>"
                                                                "<Control />"
                                                                "<Button name='ok' text='ok'    fontsize='24' />"
                                                                "<Button name='cancel' text='cancel' fontsize='24' />"
                                                              "</HorizontalLayout>"

                                                            "</VerticalLayout>"

                                                            
#string TIME_PICK_DIALOG         #language en-US            "<VerticalLayout name='background' bkcolor='0xFF004D60' inset='160,10,160,10' >"
                                                              "<VerticalLayout height='40' >"
                                                                "<Label name='title' fontsize='24' textcolor='0xFFFFFF' />"
                                                              "</VerticalLayout>"

                                                              "<HorizontalLayout childpadding='0'>"
                                                                //
                                                                // hour
                                                                //
                                                                "<VerticalLayout width='160' childpadding='4'>"
                                                                  "<Button name='hour_up' width='160' height='38' normalimage='@TimeDate1UpNormal' hotimage='@TimeDate1UpNormal' pushimage='@TimeDate1UpPush' />"
                                                                  "<UiEdit name='hour' text='1' fontsize='38' align='center' readonly='true' />"
                                                                  "<Button name='hour_down' width='160' height='38' normalimage='@TimeDate1DownNormal' hotimage='@TimeDate1DownNormal' pushimage='@TimeDate1DownPush' />"
                                                                "</VerticalLayout>"

                                                                "<Label text=':' textcolor='0xFFFFFFFF' fontsize='90' width='40' align='center'>"

                                                                //
                                                                // minute
                                                                //
                                                                "<VerticalLayout width='160' childpadding='4'>"
                                                                  "<Button name='minute_up' width='160'  height='38' normalimage='@TimeDate1UpNormal' hotimage='@TimeDate1UpNormal' pushimage='@TimeDate1UpPush' />"
                                                                  "<UiEdit name='minute' fontsize='38' align='center' readonly='true'/>"
                                                                  "<Button name='minute_down' width='160'  height='38' normalimage='@TimeDate1DownNormal' hotimage='@TimeDate1DownNormal' pushimage='@TimeDate1DownPush' />"
                                                                "</VerticalLayout>"

                                                                "<Label text=':' textcolor='0xFFFFFFFF' fontsize='90' width='40' align='center'>"

                                                                //
                                                                // second
                                                                //
                                                                "<VerticalLayout width='160' childpadding='4'>"
                                                                  "<Button name='second_up' width='160'  height='38' normalimage='@TimeDate1UpNormal' hotimage='@TimeDate1UpNormal' pushimage='@TimeDate1UpPush' />"
                                                                  "<UiEdit name='second' fontsize='38' align='center' readonly='true'/>"
                                                                  "<Button name='second_down' width='160'  height='38' normalimage='@TimeDate1DownNormal' hotimage='@TimeDate1DownNormal' pushimage='@TimeDate1DownPush' />"
                                                                "</VerticalLayout>"
                                                              "</HorizontalLayout>"

                                                              "<HorizontalLayout height='30'>"
                                                                "<Control />"
                                                                "<Button name='ok' text='ok'    fontsize='24' />"
                                                                "<Button name='cancel' text='canel' fontsize='24' />"
                                                              "</HorizontalLayout>"

                                                            "</VerticalLayout>"
                                                            
 
#string FRONT_PAGE_XML         #language en-US              "<VerticalLayout name='background' bkcolor='0xFF000000'>"
                                                              "<Control />"
                                                              "<HorizontalLayout height='530' >"
                                                                "<Control />"
                                                                "<CellLayout name='menuoptionlist' width='710' inset='0,0,0,0' cellwidth='170' cellheight='170' widthgap='10' heightgap='10' />"
                                                                "<Control />"
                                                              "</HorizontalLayout>"
                                                              "<Control />"
                                                            "</VerticalLayout>"

#string SCU_XML                #language en-US              "<VerticalLayout bkcolor='0xFFFFFFFF'>"

                                                              "<HorizontalLayout inset='0,2,0,2' >"
                                                                "<Container name='setupmenu_panel' inset='0,55,0,0' width='300' bkcolor='0xFFF4F4F4' >"
                                                                  "<VerticalLayout name ='setupmenulist' />"
                                                                "</Container>"

                                                                "<VerticalLayout inset='0,0,0,0' >"                                                                  
                                                                  "<Label height='55' name='sub_title' fontsize='40' height='55' />"
                                                                  "<HorizontalLayout>"
                                                                    "<VerticalLayout name ='menuoptionlist' vscrollbar='true' inset2='10' childpadding='5' />"
                                                                    "<VerticalLayout width='40' inset='4,0,4,0' name='bootorder' >"
                                                                      "<Control />"
                                                                      "<Button name='up'   width='32' height='32' normalimage='@BootOrderUpNormal' hotimage='@BootOrderUpFocus' pushimage='@BootOrderUpPush' />"
                                                                      "<Button name='down' width='32' height='32' normalimage='@BootOrderUpNormal' hotimage='@BootOrderUpFocus' pushimage='@BootOrderUpPush' />"
                                                                      "<Control />"
                                                                    "</VerticalLayout>"
                                                                  "</HorizontalLayout>"
                                                                "</VerticalLayout>"

                                                              "</HorizontalLayout>"

                                                              "<HorizontalLayout height='50' >"
                                                                "<Control />"
                                                                "<Button name='exit' text='Exit' bkcolor='0xFF123456' align='center' width='70' height='30' />"
                                                              "</HorizontalLayout>"
                                                            "</VerticalLayout>"
                                                             
#string SETUP_MENU_SELECT_XML          #language en-US        "textpadding='60,2,5,2' height='54' fontsize='40' textcolor='0xFFFFFFFF' bkcolor='0' bkcolor2='0' bkcolor3='0' bkimagestyle='' bkimage='@ButtonNormal' scale9grid='12,12,12,12' "
#string SETUP_MENU_UNSELECT_XML        #language en-US        "textpadding='60,2,5,2' height='54' fontsize='40' textcolor='0xFF000000' bkcolor='0xF4F4F4' bkimage='0'  bkcolor2='0xF4F4F4'"


#string FRONT_PAGE_PROMPT_XML          #language en-US        "textcolor='0x00FFFFFF' gradient_vertical='false' textpadding='5,1,1,5' borderround='0,0' fontsize='23' bordercolor='0x80888888'"
#string FRONT_PAGE_PROMPT_WITH_ANI_XML #language en-US        "textcolor='0x00FFFFFF' gradient_vertical='false' textpadding='5,1,1,5' borderround='0,0' fontsize='23' bordercolor='0x80888888' bkcolor3='0' align='bottom'"
                                                              







                                                              



                                                            